import Link from "next/link";
import Image from "next/image";
export default function WeatherPage({}) {
  return (
    <div className="mx-auto w-full px-4 sm:px-6 lg:px-8 max-w-7xl mb-4">
      <Link href="/" className="flex items-center gap-2 my-8">
        <Image
          src="/faviconDark.svg"
          alt="Pogodka Logo"
          className="block dark:hidden"
          width={90}
          height={90}
        />
        <Image
          src="/favicon.svg"
          alt="Pogodka Logo"
          className="hidden dark:block"
          width={90}
          height={90}
        />
        <h1 className="text-6xl">Pogodka</h1>
      </Link>
      <h1 className="text-3xl font-bold mb-4">Угода про конфіденційність</h1>
      <p className="mb-2">Останнє оновлення: 15 січня 2026 року</p>
      <p>
        Ласкаво просимо на вебсайт https://pogodka.org (далі – «Сайт»). Використовуючи
        Сайт, ви погоджуєтесь із цією Угодою про конфіденційність. Якщо ви не
        погоджуєтесь з умовами, будь ласка, не використовуйте Сайт.
      </p>
      <h2 className="text-2xl font-semibold mt-6 mb-2">
        1. Загальні положення
      </h2>
      <p>
        1.1. Ця Угода регулює порядок збору, використання та захисту інформації
        про користувачів Сайту.
      </p>
      <p>
        1.2. Власником Сайту є [твоя компанія/ПІБ], адреса: [адреса], e-mail:
        support@pogodka.ua
      </p>
      <h2 className="text-2xl font-semibold mt-6 mb-2">2. Збір інформації</h2>
      <p>2.1. Під час користування Сайтом можуть збиратися наступні дані:</p>
      <ul className="list-disc list-inside mb-4">
        <li>файли cookie;</li>
        <li>IP-адреса користувача;</li>
        <li>параметри та налаштування браузера;</li>
        <li>
          анонімні дані про використання Сайту (наприклад, відвідувані
          сторінки).
        </li>
      </ul>
      <p>2.2. Ці дані використовуються для:</p>
      <ul className="list-disc list-inside mb-4">
        <li>показу прогнозу погоди;</li>
        <li>покращення роботи Сайту та функціоналу;</li>
        <li>статистики відвідуваності;</li>
        <li>персоналізації контенту та реклами (включно з Google Ads).</li>
      </ul>
      <h2 className="text-2xl font-semibold mt-6 mb-2">
        3. Використання та передача даних
      </h2>
      <p>
        3.1. Зібрані дані можуть передаватися третім особам у знеособленому
        вигляді (без можливості ідентифікації конкретного користувача).
      </p>
      <p>
        3.2. Це може включати рекламні мережі, аналітичні сервіси та інші
        сервіси для статистики.
      </p>
      <p>
        3.3. Використання Сайту означає згоду користувача на таку обробку та
        передачу даних.
      </p>
      <h2 className="text-2xl font-semibold mt-6 mb-2">
        4. Керування файлами cookie
      </h2>
      <p>
        4.1. Користувач може відмовитися від cookie через налаштування браузера,
        проте деякі функції Сайту можуть працювати обмежено.
      </p>
      <p>
        4.2. Інструкції для популярних браузерів доступні на сторінках Microsoft
        Edge, Google Chrome, Safari, Firefox, Opera.
      </p>
      <h2 className="text-2xl font-semibold mt-6 mb-2">5. Права користувача</h2>
      <p>5.1. Користувач має право:</p>
      <ul className="list-disc list-inside mb-4">
        <li>доступу до своїх даних;</li>
        <li>виправлення або видалення персональних даних;</li>
        <li>відмови від обробки даних для маркетингових цілей.</li>
      </ul>
      <p>
        5.2. Для реалізації цих прав користувач може звернутись на email:
        support@pogodka.ua.
      </p>
      <h2 className="text-2xl font-semibold mt-6 mb-2">6. Захист даних</h2>
      <p>
        6.1. Всі дані зберігаються на захищених серверах з обмеженим доступом.
      </p>
      <p>
        6.2. Власником застосовуються технічні та організаційні заходи для
        захисту даних користувачів.
      </p>
      <h2 className="text-2xl font-semibold mt-6 mb-2">
        7. Скарги та звернення
      </h2>
      <p>
        7.1. У випадку порушення умов цієї Угоди користувач має право звертатися
        до контролюючих, правоохоронних або судових органів.
      </p>
      <h2 className="text-2xl font-semibold mt-6 mb-2">8. Зміни Угоди</h2>
      <p>
        8.1. Власник Сайту залишає за собою право змінювати цю Угоду у
        будь-який час.
      </p>
      <p>
        8.2. Оновлена версія Угоди публікується на Сайті з новою датою
        оновлення.
      </p>
      <p>
        8.3. Подальше використання Сайту після внесення змін означає згоду
        Користувача з новою версією Угоди.
      </p>
    </div>
  );
}
